
import { FLOWBASEANNOTATION_TYPES } from '@babel/types';
import * as React from 'react';
import { Text, View, Modal, Dimensions, StyleSheet, Image, ScrollView, TextInput, TouchableOpacity, StatusBar, Mod } from 'react-native'
import Icon from 'react-native-vector-icons/FontAwesome5'
import ModalHome from 'react-native-modalbox';

import {photo1,photo2,photo3,photo4,photo5,photo6,photo7,photo8,photo9,photo10,photo11,photo12,photo13,photo14,photo15,photo16,photo17,photo18,photo19,photo20,photo21,photo22,photo23} from './constantApp/image'

export default class App extends React.Component {
  constructor(props) {
    super(props)
    this.state = {

        visMod_Side:false,
      visMod_almal:false,
      visMod_altegara:false,
      visMod_alazahab:false,
      visMod_alfatata:false,
      visMod_almomtlakat:false,
      visMod_almogaowhratat:false,
      visMod_alzare:false,
      visMod_alestmaar:false,
      visMod_almotkaet:false,
      visMod_alstaak:false,
      visMod_cow:false,
      visMod_mazza:false,

      mainModalVis:false,
      modalVis_1: false,
      modalVis_2: false,
      modalVis_3: false,
      modalVis_4: false,
      modalVis_5: false,
      modalVis_6: false,
      
      arr:[
        {
          itemName:'على من تجب الزكاة ؟',
          itemcheck:false,
          item_d1:[
  
  
            {
             answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
            },
            {
              answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
             },
             {
              answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
             },
             {
              answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
             },
  
          ],
         
  
        },
        {
          itemName:'هل يجوز خروج الزكاة للام ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"لا يجوز و لكن تجوز عليها اموال الصدقات",
            },
          ]
  
  
        },
  
        {
          itemName:'هل يجوز خروج الزكاة للاب ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:  "لا يجوز و لكن تجوز عليه لموال الصدقات",
            },
          ]
  
  
        },
        {
          itemName:'هل يجوز خروج الزكاة للابن ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:  "لا يجوز",
            },
          ]
  
  
        },
        {
          itemName:'هل يجوز خروج الزكاة للاخ ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"نعم يجوز",
            },
          ]
  
  
        },
        {
          itemName:'هل يجوز خروج الزكاة للاقارب ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"نعم يجوز",
            },
          ],
  
  
        },
        {
          itemName:'ما هى الحالات التى لا تجب فيها زكاه المال ؟',
          itemcheck:false,
  
          item_d1:[
           
            {
              answer:"لا تجب زكاة المال على :",
            },
            {
              answer:"• ديون معدومة لا يستطيع دفعها.",
            },
            {
              answer:"• في حالة رجوع دين لا يرجى سداده يزكى عنه مرة عند رجوعه اذا مر عليه حول واحد او اكثر .",
            },
            {
              answer:"• في حالة وجود دين تكون الزكاة على من اقرض المال .",
            },
          ],
          
        },
        {
          itemName:'كيفيه حساب زكاة التجاره ؟',
          itemcheck:false,
          item_d1:[
     
            {
              answer:"إذا كان للتاجر ديون فهي تنقسم إلى:",
            },
            {
              answer:". ديون مضمونة عند تجار أمناء فيجب عليه إخراج زكاة عنها.",
            },
            {
              answer:". ديون غير مضمونة فلا تجب عليها زكاة",
            },
            {
              answer:". أما إذا كان هو المستدين فزكاة هذا المال تقع على من اقرضه المال.",
            },
          ],
  
        },
        {
          itemName:'كيفيه حساب زكاة الذهب ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"يتم حساب النصاب كالتالي:",
            },
            {
              answer:" نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم",
            },
            {
              answer:". نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
            },
            {
              answer:". نصاب الذهب عيار 24 هو ما يساوي 84 جرام * سعر الجرام بسعر اليوم",
            },
          ],
         
        },
        {
          itemName:'هناك زكاة على ذهب النساء للزينه ؟',
          itemcheck:false,
          item_d1:[
              {
                answer:"ذهب النساء للزينة فيها قولان :"
              },
              {
                answer:"1- لا زكاة فيه : وهو قول جمهور العلماء . عند الامام مالك والليث والشافعي والإمام احمد وروي عن ذلك عائشة وأسماء وعبد الله ابن عمر وانس وجابر رضي الله عنهم .",
              },
              {
                answer:"2- فيه زكاة : عند عمر بن الخطاب وابن مسعود وابن عباس وجماعة من التابعين وهو مذهب أبي حنيفة والثوري والاوزعي .",
              },
            
            ],


  
        },
        {
          itemName:'متى تجب الزكاة على المجوهرات ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"تجب الزكاة عليها إذا كانت معدة للإتجار مثل ( الذهب والألماظ والؤلؤ وأي أحجار كريمة )",
            },
           
          ],
  
  
        },
  
        {
          itemName:'متى يجب اخراج زكاة الممتلكات المؤجره ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"إذا لم يتم صرف الإيجار وحال عليه الحول يجب إخراج زكاة ولكن إذا صرف المبلغ أول بأول يجب عدم إخراجها",
            },
        
          ],
          
  
  
        },
        {
          itemName:'ما هى الحالات التى لا يجب فيها زكاة     الاستثمار العقارى ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"لا تجب الزكاة في",
            },
            {
              answer:"• البيوت سكن او ترفيه او مصيف",
            },
            {
              answer:"• السيارات : ركوب او نقل",
            },
            {
              answer:". محلات",
            },
            {
              answer:". ارض ميراث : غير زراعية او غير مستخدمة للاستثمار",
            },
          ],
          
  
  
        },
        {
          itemName:'كيفية حساب زكاة الزرع ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:". تجب عند الحصاد للحبوب والثمار",
            },
            {
              answer:"يتم تقدير قيمتها المالية الحالية وحساب زكاة المال عليها",
            },
            {
              answer:". زكاة الزروع يمكن إخراجها من المحصول في صورة حبوب ويمكن إخراجها مال بما يعادل قيمة الزكاة",
            },
            {
              answer:". اذا ساوی او زاد المحصول عن 5 او سق أي ما يعادل 653 كيلو جرام لقوله صل الله عليه وسلم ( ليس فيما دون خمسة أوسق صدقة )",
            },
            
          ],
  
  
        },
        {
          itemName:'ماهى زكاة الصداق و متى يجب اخراجها ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"هو مهر الزواج للمرأة إن قبضته وبلغ النصاب وحال عليه الحول تدفع الزكاة مرة واحدة",
            },
        
          ],
  
  
        },
        {
          itemName:'هل هناك زكاه على مكافأة التقاعد ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"يزكى لها واحدة لسنة واحده",
            },
          ],
  
  
        },
        {
          itemName:'كيفية حساب زكاة المواشى ؟',
          itemcheck:false,
          item_d1:[
            {
              answer:"• تجب زكاة الحيوانات على المواشي التي ترعى في العشب النابت دون قصد زراعته لرعيها"
            },
            {
              answer:". اما اذا كانت ترعى في مزرعة تم زراعتها من اجلها او يتم تسمينها فهي تدخل في زكاة الأموال"
            },
            {
              answer:". زكاة الماشية يمكن إخراجها من الماشية ويمكن إخراجها مال بما يعادل قيمة الزكاة"
            },
            {
              answer:". في حالة تسمين الحيواني يتم معاملتها كمعاملة زكاة المال ، أي عندما يمر عليها الحول وبلغت النصاب يتم تقدير المملوك من الرؤوس على حسب السوق الحالي ويتم دفع زكاتها مال"
            },
          ],
  
  
        },
           
  
      ],

      arr2: [

        {
          img: photo1,
          title: "أكلهم من أكلك ",
          desc: "يقوم فريق أكلهم من أكلك في رمضان بوضع طبق فوم  في المساجد طوال رمضان يقوم المتبرع باخذ طبق عند صلاة الظهر وإعادته إلى  المسجد عصرا بوجبة من إفطاره في هذا اليوم  تم يقوم الفريق بتوزيع الوجبات على الاسر الفقيرة يوميا  بعد العصر                        للتواصل: 01000606014 "
        },
        {
          img: photo2,
          title: "زكاة الفطر",
          desc: "يتم تجميع زكاة الفطر وتوزيعها علي الأسر الفقراء قبل صلاة العيد"
        },
        {
          img: photo3,
          title: "الحج والعمرة",
          desc: "تقوم الجمعية بتوفير رحلات حج وعمرة بالتعاون مع كبرى الشركات السياحية في المنصورة"
        },
        {
          img: photo4,
          title: "صحوك وجلود الاضاحى",
          desc: "ستقوم الجمعية بتوفير صكوك الأضاحي ويكون سعر  الصك سامل الجزارة والتكييس تيسيرا من الجمعية  لإقامة الشريعة  كما تقبل الجمعية لحوم وجلود الاضاحي لتوزيعها على  الفقراء "
        },

        {
          img: photo5,
          title: "حضانة خير زاد",
          desc: "تقدم الحضانة برنامج  تعليمي مميز تحت اشراف نخبة من المتخصصين في العلوم التربوية وتنمية المهارات وتوفر تواصل دائم مع الاباء والامهات عن طريق جروب الفيس بوك والواتس اب  الحضانة مشروع ربحي العائد المادى المحقق منه يصرف على الاسر الغير قادره الخاصه بالجمعية في كافه الاحتياجات الماديه والطبيه  العنوان: توريل- شارع مدرسة الملك الكامل- بجوار  صيدلية عسكر         للتواصل: ٠١٠٦٠٢٠٧١٧١"
        },
        {
          img: photo6,
          title: "الصدقة الجارية",

          desc: " تقوم الجمعية بصرف الصدقات الجارية فى البنود الآتية:                                                                                     •اجهزة 9C.pap Concentrator Oxygen لمرضى الفشل التنفسى                                   •توفير الأجهزة الطبية بالتعاون مع مستشفيات جامعة  المنصورة والتبرع بها لصالح الأقسام الغير متوفر بها هذه  الأجهزة                                                                 •بناع المساجد                                                  •عمل كولديرات المياة "
        },
        {
          img: photo7,
          title: "مشروع بنك الدم الخيري",

          desc: " •مشروع قومي بالتعاون مع الكثير من الجمعيات  المهتمة بمجال التبرع بالدم عن طريق إقامة موقع بنك ادم الخيري                                                                                                                                 •يقوم فريق بنك الدم بجمع بيانات المتبرعين وتسجيلها  على الموقع وتوفير إحتياجات المرضى من الدم عن طريق  كول سنر بالأرقام التالية                                          01000606015 - 01000606016 "
        },
        {
          img: photo8,
          title: "كفالة الاسر الفقيرة",
          desc: "تقوم الجمعية بكفالة عدد كبير من الأسر بالمنصورة  كفالة شهرية                                                        •حيث تقوم بتوزيع شنط تحتوى على: (٥ كيلو أرز-1 كيلو  مكرونة-1 كيلو عدس- كيلو لوبيا- زجاجة زيت- علبة  سمنة) "
        },
        {
          img: photo9,
          title:"المشروع الطبي الخيري",
          desc: "•تقوم الجمعية بتوفير كشوفات مجانية والعمليات  الجراحية والأجهزة التعويضية للأسر الفقيرة في جميع  التخصصات وذلك بالإتفاق مع العديد من الأطباء  المتخصصين وذلك مساهمة منهم في تخفيف آلام  الفقراء                              •كما يتم صرف الدواء للفقراء من صيدلية الجمعية "
        },
        {
          img: photo10,
          title: "حضانة خير زاد",
          desc: "كل يوم مواليد جديده بتتولد محتاجين لحضانه ورعايه طبيه  متميزه                                                       هؤلاء الاطفال بين أهل مقتدرين وأهل غير مقتدرين  خيرزاد بتوفر حضانه طبيه متخصصه على اعلى مستوى  باسعار خيريه للمقتدرين ومجانا لغير المقتدرين واستقبال  اطفال ٢٤ ساعه                                                           العنوان: المنصورة- حي الجامعة- امام مستشفى الغزالي-  خلف وكالة ابو رية  للتواصل:01021277660"
        },
        {
          img: photo11,
          title: "مشرو الملابس",
          desc: "•يقوم فريق جمع الملابس بتوفير الملابس الجديدة  والمستعملة من المتبرعين من المحلات وفرزها وإعادة  توزيعها على الأسر الفقيرة •تقوم الجمعية بتوفير ملابس العيد وملابس المدارس  للأسر الفقيرة                                                   •تقوم الجمعية بتوفير شنط المدارس لأطفال الأسر  الفقيرة "
        },

      ],
      save_index2 : 0,

      itemcheck:true,
      item_d:
      [
    {
      itemtext:'رصيد في البنك',
      itemshow:false,

    },
    {
      itemtext:'شهادات استثمار',
      itemshow:false,

    },
    {
      itemtext:'اموال(للزواج او الحج او شراء سيارة)',
      itemshow:false,

    },
    {
      itemtext:'ديوان مؤجلة',
      itemshow:false,

    },
    {
      itemtext:'سندات',
      itemshow:false,

    },
  ],
  itemcheck3:true,
  item_d3:
  [
{
  itemtext3:'راس المال(سيولة)',
  itemshow3:false,

},
{
  itemtext3:"كل ما يحل بيعه حتى الاسهم الورقيه",
  itemshow3:false,

},
{
  itemtext3:'قيمة البضائع في المحلات والمخازن',
  itemshow3:false,

},
{
  itemtext3:'قيمة المواشي للتجارة',
  itemshow3:false,

},
],

itemcheck2:true,
item_d2:
[
{
itemtext2:'عيار 18',
itemshow2:false,

},
{
itemtext2:'عيار 21',
itemshow2:false,

},
{
itemtext2:'عيار 24',
itemshow2:false,

},
],
save_index:0,
price:0,
value_to_calculate:0,
final:0,
modVis2:false,
   

    itemshow6:false,
    itemshow7:false,
    itemshow9:false,
 value_to_calculate:0,
 final:0,
 modVis:false,
 modVis3:false,
 modVis2:false,

 vismodalzaka:false,
 
 arraseal:[
  {
    itemName:'على من تجب الزكاة ؟',
    itemcheck:false,
    item_d1:[


      {
       answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
      },
      {
        answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
       },
       {
        answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
       },
       {
        answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
       },

    ],
   

  },
  {
    itemName:'هل يجوز خروج الزكاة للام ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"لا يجوز و لكن تجوز عليها اموال الصدقات",
      },
    ]


  },

  {
    itemName:'هل يجوز خروج الزكاة للاب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:  "لا يجوز و لكن تجوز عليه لموال الصدقات",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للابن ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:  "لا يجوز",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للاخ ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"نعم يجوز",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للاقارب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"نعم يجوز",
      },
    ],


  },
  {
    itemName:'ما هى الحالات التى لا تجب فيها زكاه المال ؟',
    itemcheck:false,

    item_d1:[
     
      {
        answer:"لا تجب زكاة المال على :",
      },
      {
        answer:"• ديون معدومة لا يستطيع دفعها.",
      },
      {
        answer:"• في حالة رجوع دين لا يرجى سداده يزكى عنه مرة عند رجوعه اذا مر عليه حول واحد او اكثر .",
      },
      {
        answer:"• في حالة وجود دين تكون الزكاة على من اقرض المال .",
      },
    ],
    
  },
  {
    itemName:'كيفيه حساب زكاة التجاره ؟',
    itemcheck:false,
    item_d1:[

      {
        answer:"إذا كان للتاجر ديون فهي تنقسم إلى:",
      },
      {
        answer:". ديون مضمونة عند تجار أمناء فيجب عليه إخراج زكاة عنها.",
      },
      {
        answer:". ديون غير مضمونة فلا تجب عليها زكاة",
      },
      {
        answer:". أما إذا كان هو المستدين فزكاة هذا المال تقع على من اقرضه المال.",
      },
    ],

  },
  {
    itemName:'كيفيه حساب زكاة الذهب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"يتم حساب النصاب كالتالي:",
      },
      {
        answer:" نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم",
      },
      {
        answer:". نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
      },
      {
        answer:". نصاب الذهب عيار 24 هو ما يساوي 84 جرام * سعر الجرام بسعر اليوم",
      },
    ],
   
  },
  {
    itemName:'هناك زكاة على ذهب النساء للزينه ؟',
    itemcheck:false,
    item_d1:[
        {
          answer:"ذهب النساء للزينة فيها قولان :"
        },
        {
          answer:"1- لا زكاة فيه : وهو قول جمهور العلماء . عند الامام مالك والليث والشافعي والإمام احمد وروي عن ذلك عائشة وأسماء وعبد الله ابن عمر وانس وجابر رضي الله عنهم .",
        },
        {
          answer:"2- فيه زكاة : عند عمر بن الخطاب وابن مسعود وابن عباس وجماعة من التابعين وهو مذهب أبي حنيفة والثوري والاوزعي .",
        },
      
      ],

  },
  {
    itemName:'متى تجب الزكاة على المجوهرات ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"تجب الزكاة عليها إذا كانت معدة للإتجار مثل ( الذهب والألماظ والؤلؤ وأي أحجار كريمة )",
      },
     
    ],


  },

  {
    itemName:'متى يجب اخراج زكاة الممتلكات المؤجره ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"إذا لم يتم صرف الإيجار وحال عليه الحول يجب إخراج زكاة ولكن إذا صرف المبلغ أول بأول يجب عدم إخراجها",
      },
  
    ],
    


  },
  {
    itemName:'ما هى الحالات التى لا يجب فيها زكاة     الاستثمار العقارى ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"لا تجب الزكاة في",
      },
      {
        answer:"• البيوت سكن او ترفيه او مصيف",
      },
      {
        answer:"• السيارات : ركوب او نقل",
      },
      {
        answer:". محلات",
      },
      {
        answer:". ارض ميراث : غير زراعية او غير مستخدمة للاستثمار",
      },
    ],
    


  },
  {
    itemName:'كيفية حساب زكاة الزرع ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:". تجب عند الحصاد للحبوب والثمار",
      },
      {
        answer:"يتم تقدير قيمتها المالية الحالية وحساب زكاة المال عليها",
      },
      {
        answer:". زكاة الزروع يمكن إخراجها من المحصول في صورة حبوب ويمكن إخراجها مال بما يعادل قيمة الزكاة",
      },
      {
        answer:". اذا ساوی او زاد المحصول عن 5 او سق أي ما يعادل 653 كيلو جرام لقوله صل الله عليه وسلم ( ليس فيما دون خمسة أوسق صدقة )",
      },
      
    ],


  },
  {
    itemName:'ماهى زكاة الصداق و متى يجب اخراجها ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"هو مهر الزواج للمرأة إن قبضته وبلغ النصاب وحال عليه الحول تدفع الزكاة مرة واحدة",
      },
  
    ],


  },
  {
    itemName:'هل هناك زكاه على مكافأة التقاعد ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"يزكى لها واحدة لسنة واحده",
      },
    ],


  },
  {
    itemName:'كيفية حساب زكاة المواشى ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"• تجب زكاة الحيوانات على المواشي التي ترعى في العشب النابت دون قصد زراعته لرعيها"
      },
      {
        answer:". اما اذا كانت ترعى في مزرعة تم زراعتها من اجلها او يتم تسمينها فهي تدخل في زكاة الأموال"
      },
      {
        answer:". زكاة الماشية يمكن إخراجها من الماشية ويمكن إخراجها مال بما يعادل قيمة الزكاة"
      },
      {
        answer:". في حالة تسمين الحيواني يتم معاملتها كمعاملة زكاة المال ، أي عندما يمر عليها الحول وبلغت النصاب يتم تقدير المملوك من الرؤوس على حسب السوق الحالي ويتم دفع زكاتها مال"
      },
    ],


  },
     

],

arraseal2:[
  {
    itemName2:'ما هي المبادئ العشرة, اذكر مبادئ هذا الفن ؟',
    itemcheck2:false,
    item_d12:[


      {
       answer2:"هي حد العلم؛ وموضوعه، وثمرته، ونسبته إلى غيره، وواضعه، واسمه، واستمداده وحكمه، ومسائله، وفضله."
      },
      {
        answer2:"حَدُّهُ: هو فقه المواريث، وما يضم إلى ذلك من حسابها."
      },

      {
        answer2:"موضوعه : التركات."
      },

      {
        answer2:"وثمرته: إيصال ذوي الحقوق حقوقَهم."
      },

      {
        answer2:"نسبته إلى غيره: أنه من العلوم الشرعية."
      },
        {
        answer2:"حكمه: فرض كفاية إذا قام به من يكفي سقط عن الباقين"
      },


    ],
   

  },
  {
    itemName2:'ما معنى الرُّكْن لغة واصطلاحًا ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"الأركان جمع ركن، وهو جانب الشيء الأقوى، وفي الاصطلاح هو عبارة عن جزء الماهية. ",
      },
    ]


  },

  {
    itemName2:'كم أركان الإرث، وما هي ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:  "أركان الإرث ثلاثة، وهي وارث ومُوَرِّث وحق موروث.",
      },
    ]


  },
  {
    itemName2:'كم شروط الإرث، وما هي؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:  "لأول: تحقق موت المُوَرِّث إما بمشاهدة أو بشهادة عدلين، أو إلحاقه بالأموات حكمًا: كالمفقود، أو إلحاقه بالأموات تقديرًا: كالجنين إذا انفصل ميتًا بسبب جناية على أمه توجب الْغُرَّة، وهي عبد أو أَمَة تقدر بخمس من الإبل تكون لورثة الجنين.",
      },
      {
        answer2:  "الثاني: تحقق حياة الوارث بعد موت مورثه ولو لحظة.",
      },
      {
        answer2:  "الثالث: العلم بالجهة المقتضية للإرث من زوجية أو ولاء أو قرابة، وتعيين جهة القرابة من بنوة أو أبوة أو نحو ذلك، والعلم بالدرجة التي اجتمع فيها الميت والوارث.",
      },
    ]


  },
  {
    itemName2:'ما معنى الإرث لغة واصطلاحًا ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"لغة: البقية وانتقال الشيء من قوم إلى قوم آخرين، واصطلاحًا: هو حق قابل التجزُّئ يثبت لمستحِق بعد موت من كان له القرابة بينهما أو نحوها.            ",
      },
    ]


  },
  {
    itemName2:'كم الوارثين من الرجال ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"لوارثون من الرجال بالاختصار عشرة، وبالبسط خمسة عشر، وهم :الابن، وابن الابن، والأب، والجد، والأخ لأم، والأخ لأب، والأخ الشقيق، وابن الأخ لأب، وابن الأخ الشقيق، والعم الشقيق، والعم لأب، وابن العم الشقيق، وابن العم لأب، والزوج والمعتِق. ",
      },
    ],


  },
  {
    itemName2:' كم الوارثات من النساء؟',
    itemcheck2:false,

    item_d12:[
     
      {
        answer2:"بالاختصار سبع وبالبسط عشر: البنت، وبنت الابن، والأم، والجدة من قِبَلها، والجدة من قِبَل الأب، وأبي الأب، والأخت الشقيقة، والأخت لأب، والأخت لأم، والزوجة، والمعتِقة. ",
      },
      
    ],
    
  },
  {
    itemName2:'ما معنى التعصيب لغة وشرعًا ؟',
    itemcheck2:false,
    item_d12:[

      {
        answer2:"التعصيب لغة مصدر عصب يعصب تعصيبًا فهو عاصب، والعَصَبَة لغة قرابة الرجل لأبيه، سموا بذلك لأنهم عصبوا به أي أحاطوا.",
      },
      {
        answer2:"واصطلاحًا العصبة من يرث بغير تقدير، وإذا أطلق العاصب فالمراد به العصبة بالنفس.",
      },
      
    ],

  },

  {
    itemName2:'كم أقسام العصبة؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"ينقسمون أولًا إلى قسمين عصبة بنسب وعصبة بسبب، ثم العصبة بالنسب ينقسمون إلى ثلاثة أقسام: عصبة بنفسه، وعصبة بغيره، وعصبة مع غيره.",
      },
     
    ],
   
  },

  {
    itemName2:'ما هو ضابط العصبة بالنفس، وما هو عددهم؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"ضابط العصبة بالنفس:كل ذكر لا تدخل في نسبته إلى الميت أنثى غير الزوج والأخ لأم، وعددهم أربعة عشر: الابن، وابن الابن وإن نزل، والأب وأبوه وإن علا، والأخ الشقيق، والأخ لأب، وابن الأخ لأب، والعم الشقيق، والعم لأب، وابن العم الشقيق، وابن العم لأب، والمعتِق، والمعتِقة.",
      },
     
    ],
   
  },
   
  

],

arraseal:[
  {
    itemName:'على من تجب الزكاة ؟',
    itemcheck:false,
    item_d1:[


      {
       answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
      },
      {
        answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
       },
       {
        answer:"لزكاة تجب على كل مسلم بالغ، بلغت امواله النصاب وحال عليه الحول ( اي مرور عام على حوزه هذا المدخر ) يتم حساب النصاب كالتالي:"
       },
       {
        answer:". نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم . نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
       },

    ],
   

  },
  {
    itemName:'هل يجوز خروج الزكاة للام ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"لا يجوز و لكن تجوز عليها اموال الصدقات",
      },
    ]


  },

  {
    itemName:'هل يجوز خروج الزكاة للاب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:  "لا يجوز و لكن تجوز عليه لموال الصدقات",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للابن ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:  "لا يجوز",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للاخ ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"نعم يجوز",
      },
    ]


  },
  {
    itemName:'هل يجوز خروج الزكاة للاقارب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"نعم يجوز",
      },
    ],


  },
  {
    itemName:'ما هى الحالات التى لا تجب فيها زكاه المال ؟',
    itemcheck:false,

    item_d1:[
     
      {
        answer:"لا تجب زكاة المال على :",
      },
      {
        answer:"• ديون معدومة لا يستطيع دفعها.",
      },
      {
        answer:"• في حالة رجوع دين لا يرجى سداده يزكى عنه مرة عند رجوعه اذا مر عليه حول واحد او اكثر .",
      },
      {
        answer:"• في حالة وجود دين تكون الزكاة على من اقرض المال .",
      },
    ],
    
  },
  {
    itemName:'كيفيه حساب زكاة التجاره ؟',
    itemcheck:false,
    item_d1:[

      {
        answer:"إذا كان للتاجر ديون فهي تنقسم إلى:",
      },
      {
        answer:". ديون مضمونة عند تجار أمناء فيجب عليه إخراج زكاة عنها.",
      },
      {
        answer:". ديون غير مضمونة فلا تجب عليها زكاة",
      },
      {
        answer:". أما إذا كان هو المستدين فزكاة هذا المال تقع على من اقرضه المال.",
      },
    ],

  },
  {
    itemName:'كيفيه حساب زكاة الذهب ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"يتم حساب النصاب كالتالي:",
      },
      {
        answer:" نصاب الذهب عيار 18 هو ما يساوي 113 جرام * سعر الجرام بسعر اليوم",
      },
      {
        answer:". نصاب الذهب عيار 21 هو ما يساوي97 جرام * سعر الجرام بسعر اليوم",
      },
      {
        answer:". نصاب الذهب عيار 24 هو ما يساوي 84 جرام * سعر الجرام بسعر اليوم",
      },
    ],
   
  },
  {
    itemName:'هناك زكاة على ذهب النساء للزينه ؟',
    itemcheck:false,
    item_d1:[
        {
          answer:"ذهب النساء للزينة فيها قولان :"
        },
        {
          answer:"1- لا زكاة فيه : وهو قول جمهور العلماء . عند الامام مالك والليث والشافعي والإمام احمد وروي عن ذلك عائشة وأسماء وعبد الله ابن عمر وانس وجابر رضي الله عنهم .",
        },
        {
          answer:"2- فيه زكاة : عند عمر بن الخطاب وابن مسعود وابن عباس وجماعة من التابعين وهو مذهب أبي حنيفة والثوري والاوزعي .",
        },
      
      ],

  },
  {
    itemName:'متى تجب الزكاة على المجوهرات ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"تجب الزكاة عليها إذا كانت معدة للإتجار مثل ( الذهب والألماظ والؤلؤ وأي أحجار كريمة )",
      },
     
    ],


  },

  {
    itemName:'متى يجب اخراج زكاة الممتلكات المؤجره ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"إذا لم يتم صرف الإيجار وحال عليه الحول يجب إخراج زكاة ولكن إذا صرف المبلغ أول بأول يجب عدم إخراجها",
      },
  
    ],
    


  },
  {
    itemName:'ما هى الحالات التى لا يجب فيها زكاة     الاستثمار العقارى ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"لا تجب الزكاة في",
      },
      {
        answer:"• البيوت سكن او ترفيه او مصيف",
      },
      {
        answer:"• السيارات : ركوب او نقل",
      },
      {
        answer:". محلات",
      },
      {
        answer:". ارض ميراث : غير زراعية او غير مستخدمة للاستثمار",
      },
    ],
    


  },
  {
    itemName:'كيفية حساب زكاة الزرع ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:". تجب عند الحصاد للحبوب والثمار",
      },
      {
        answer:"يتم تقدير قيمتها المالية الحالية وحساب زكاة المال عليها",
      },
      {
        answer:". زكاة الزروع يمكن إخراجها من المحصول في صورة حبوب ويمكن إخراجها مال بما يعادل قيمة الزكاة",
      },
      {
        answer:". اذا ساوی او زاد المحصول عن 5 او سق أي ما يعادل 653 كيلو جرام لقوله صل الله عليه وسلم ( ليس فيما دون خمسة أوسق صدقة )",
      },
      
    ],


  },
  {
    itemName:'ماهى زكاة الصداق و متى يجب اخراجها ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"هو مهر الزواج للمرأة إن قبضته وبلغ النصاب وحال عليه الحول تدفع الزكاة مرة واحدة",
      },
  
    ],


  },
  {
    itemName:'هل هناك زكاه على مكافأة التقاعد ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"يزكى لها واحدة لسنة واحده",
      },
    ],


  },
  {
    itemName:'كيفية حساب زكاة المواشى ؟',
    itemcheck:false,
    item_d1:[
      {
        answer:"• تجب زكاة الحيوانات على المواشي التي ترعى في العشب النابت دون قصد زراعته لرعيها"
      },
      {
        answer:". اما اذا كانت ترعى في مزرعة تم زراعتها من اجلها او يتم تسمينها فهي تدخل في زكاة الأموال"
      },
      {
        answer:". زكاة الماشية يمكن إخراجها من الماشية ويمكن إخراجها مال بما يعادل قيمة الزكاة"
      },
      {
        answer:". في حالة تسمين الحيواني يتم معاملتها كمعاملة زكاة المال ، أي عندما يمر عليها الحول وبلغت النصاب يتم تقدير المملوك من الرؤوس على حسب السوق الحالي ويتم دفع زكاتها مال"
      },
    ],


  },
     

],

arraseal2:[
  {
    itemName2:'ما هي المبادئ العشرة, اذكر مبادئ هذا الفن ؟',
    itemcheck2:false,
    item_d12:[


      {
       answer2:"هي حد العلم؛ وموضوعه، وثمرته، ونسبته إلى غيره، وواضعه، واسمه، واستمداده وحكمه، ومسائله، وفضله."
      },
      {
        answer2:"حَدُّهُ: هو فقه المواريث، وما يضم إلى ذلك من حسابها."
      },

      {
        answer2:"موضوعه : التركات."
      },

      {
        answer2:"وثمرته: إيصال ذوي الحقوق حقوقَهم."
      },

      {
        answer2:"نسبته إلى غيره: أنه من العلوم الشرعية."
      },
        {
        answer2:"حكمه: فرض كفاية إذا قام به من يكفي سقط عن الباقين"
      },


    ],
   

  },
  {
    itemName2:'ما معنى الرُّكْن لغة واصطلاحًا ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"الأركان جمع ركن، وهو جانب الشيء الأقوى، وفي الاصطلاح هو عبارة عن جزء الماهية. ",
      },
    ]


  },

  {
    itemName2:'كم أركان الإرث، وما هي ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:  "أركان الإرث ثلاثة، وهي وارث ومُوَرِّث وحق موروث.",
      },
    ]


  },
  {
    itemName2:'كم شروط الإرث، وما هي؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:  "لأول: تحقق موت المُوَرِّث إما بمشاهدة أو بشهادة عدلين، أو إلحاقه بالأموات حكمًا: كالمفقود، أو إلحاقه بالأموات تقديرًا: كالجنين إذا انفصل ميتًا بسبب جناية على أمه توجب الْغُرَّة، وهي عبد أو أَمَة تقدر بخمس من الإبل تكون لورثة الجنين.",
      },
      {
        answer2:  "الثاني: تحقق حياة الوارث بعد موت مورثه ولو لحظة.",
      },
      {
        answer2:  "الثالث: العلم بالجهة المقتضية للإرث من زوجية أو ولاء أو قرابة، وتعيين جهة القرابة من بنوة أو أبوة أو نحو ذلك، والعلم بالدرجة التي اجتمع فيها الميت والوارث.",
      },
    ]


  },
  {
    itemName2:'ما معنى الإرث لغة واصطلاحًا ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"لغة: البقية وانتقال الشيء من قوم إلى قوم آخرين، واصطلاحًا: هو حق قابل التجزُّئ يثبت لمستحِق بعد موت من كان له القرابة بينهما أو نحوها.            ",
      },
    ]


  },
  {
    itemName2:'كم الوارثين من الرجال ؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"لوارثون من الرجال بالاختصار عشرة، وبالبسط خمسة عشر، وهم :الابن، وابن الابن، والأب، والجد، والأخ لأم، والأخ لأب، والأخ الشقيق، وابن الأخ لأب، وابن الأخ الشقيق، والعم الشقيق، والعم لأب، وابن العم الشقيق، وابن العم لأب، والزوج والمعتِق. ",
      },
    ],


  },
  {
    itemName2:' كم الوارثات من النساء؟',
    itemcheck2:false,

    item_d12:[
     
      {
        answer2:"بالاختصار سبع وبالبسط عشر: البنت، وبنت الابن، والأم، والجدة من قِبَلها، والجدة من قِبَل الأب، وأبي الأب، والأخت الشقيقة، والأخت لأب، والأخت لأم، والزوجة، والمعتِقة. ",
      },
      
    ],
    
  },
  {
    itemName2:'ما معنى التعصيب لغة وشرعًا ؟',
    itemcheck2:false,
    item_d12:[

      {
        answer2:"التعصيب لغة مصدر عصب يعصب تعصيبًا فهو عاصب، والعَصَبَة لغة قرابة الرجل لأبيه، سموا بذلك لأنهم عصبوا به أي أحاطوا.",
      },
      {
        answer2:"واصطلاحًا العصبة من يرث بغير تقدير، وإذا أطلق العاصب فالمراد به العصبة بالنفس.",
      },
      
    ],

  },

  {
    itemName2:'كم أقسام العصبة؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"ينقسمون أولًا إلى قسمين عصبة بنسب وعصبة بسبب، ثم العصبة بالنسب ينقسمون إلى ثلاثة أقسام: عصبة بنفسه، وعصبة بغيره، وعصبة مع غيره.",
      },
     
    ],
   
  },

  {
    itemName2:'ما هو ضابط العصبة بالنفس، وما هو عددهم؟',
    itemcheck2:false,
    item_d12:[
      {
        answer2:"ضابط العصبة بالنفس:كل ذكر لا تدخل في نسبته إلى الميت أنثى غير الزوج والأخ لأم، وعددهم أربعة عشر: الابن، وابن الابن وإن نزل، والأب وأبوه وإن علا، والأخ الشقيق، والأخ لأب، وابن الأخ لأب، والعم الشقيق، والعم لأب، وابن العم الشقيق، وابن العم لأب، والمعتِق، والمعتِقة.",
      },
     
    ],
   
  },
   

],
Visaseeelaa:false,
Visaselazaka:false,
Visaselalmras:false,
Visactivitie:false

    }}



    checked1(index1){
      let arraseal=this.state.arraseal
      arraseal[index1].itemcheck=!arraseal[index1].itemcheck
      this.setState({arraseal})
    }
       

    checkedasela(index1){
      let arraseal2=this.state.arraseal2
      arraseal2[index1].itemcheck2=!arraseal2[index1].itemcheck2
      this.setState({arraseal2})
    }


    checked(index1){
      let arr=this.state.arr
      arr[index1].itemcheck=!arr[index1].itemcheck
      this.setState({arr})
    }
  
  
  
     checked_1(index){
      let item_d=this.state.item_d
      let size = item_d.length
      for(let i=0;i<size;i++){
        item_d[i].itemshow=false
      }
      item_d[index].itemshow=true
    console.log(size)
      this.setState({item_d})
    }
  
  
  
    checked_2(index2){
      let item_d2=this.state.item_d2
      let size = item_d2.length
      for(let i=0;i<size;i++){
        item_d2[i].itemshow2=false
      }
      item_d2[index2].itemshow2=true
    console.log(size)
      this.setState({item_d2})
      this.setState({save_index:index2})
    }
  
   
  
  
  
    calculate_dahab() {
      let val = this.state.value_to_calculate
      let final = this.state.final
      let price=this.state.price
     
      if(val%2==1||val%2==0){
        
        
        switch(this.state.save_index){
          case 0:
          if(this.state.value_to_calculate>=113){
            price=800    
          } else{
            alert("الزكاة تجب فقط عندم تبلغ النصاب ")
          }
            break;
    
            case 1:
              if(this.state.value_to_calculate>=97){
              price=900
            }else{
              alert("الزكاة تجب فقط عندم تبلغ النصاب ")
            }
              break;
    
              case 2:
                if(this.state.value_to_calculate>=84){
              price=950
            }
            else{
              alert("الزكاة تجب فقط عندم تبلغ النصاب ")
            }
              break;
        }
     
        final=(val*price)/1000*25
        this.setState({ final: final })
      
      }
      
      else {
        alert('من فضلك ادخل رقم بالانجليزي فقط')
      }
     
    }
  
  
    checked_3(index3){
      let item_d3=this.state.item_d3
      let size = item_d3.length
      for(let i=0;i<size;i++){
        item_d3[i].itemshow3=false
      }
      item_d3[index3].itemshow3=true
    console.log(size)
      this.setState({item_d3})
    }
  
  
    calculate() {
      let val = this.state.value_to_calculate
      let final = this.state.final
      if(val%2==1||val%2==0){
        if(val>=96474){
        final = val / 1000 * 25
        this.setState({ final: final })
      }
      else {
        alert('ليس فيها زكاه فهي لم تبلغ النصاب')
      }
      }else {
        alert('من فضلك ادخل رقم بالانجليزي فقط')
      }
     
    }
  
  
  
    calculate_dahab() {
      let val = this.state.value_to_calculate
      let final = this.state.final
      let price=this.state.price
     
      if(val%2==1||val%2==0){
        
        
        switch(this.state.save_index){
          case 0:
          if(this.state.value_to_calculate>=113){
            price=800    
          } else{
            alert("الزكاة تجب فقط عندم تبلغ النصاب ")
          }
            break;
    
            case 1:
              if(this.state.value_to_calculate>=97){
              price=900
            }else{
              alert("الزكاة تجب فقط عندم تبلغ النصاب ")
            }
              break;
    
              case 2:
                if(this.state.value_to_calculate>=84){
              price=950
            }
            else{
              alert("الزكاة تجب فقط عندم تبلغ النصاب ")
            }
              break;
        }
     
        final=(val*price)/1000*25
        this.setState({ final: final })
      
      }
      
      else {
        alert('من فضلك ادخل رقم بالانجليزي فقط')
      }
     
  
    }
  
    calculate_zare() {
      let val= this.state.value_to_calculate
      let final = this.state.final
      
     
      if(val%2==1||val%2==0){
        if(val>=96474){
       if(this.state.itemshow9==true ){
        final=val/100*5
       }else{
        final=val/100*10
       }
      } 
      else {
        alert("ليس فها زكاه")
      }
        
        this.setState({ final: final })
      
      }
      
      else {
        alert('من فضلك ادخل رقم بالانجليزي فقط')
      }
     
  
    }
  
    
    checked1(index1){
      let arraseal=this.state.arraseal
      arraseal[index1].itemcheck=!arraseal[index1].itemcheck
      this.setState({arraseal})
    }
       

    checked(index1){
      let arraseal2=this.state.arraseal2
      arraseal2[index1].itemcheck2=!arraseal2[index1].itemcheck2
      this.setState({arraseal2})
    }
       

  render() {
    return (
      <>
        <View style={{
          height: '100%',
          width: '100%',
          backgroundColor: '#fff',
          paddingHorizontal: 20,
          paddingVertical: 20
        }}>
            <View style={{
              height: 200,
              width: 200,
              // borderWidth: 2,
               backgroundColor:'#fff',
              // borderColor: '#666',
              borderRadius: 50,
              transform: [{ rotate: '299deg' }],
              position: 'absolute',
              marginTop: -50,
              marginLeft: 270,
              shadowColor:'#000',
              elevation:10,
            }}></View>

            <View style={{
              height: 200,
              width: 200,
              backgroundColor: '#592c87',
              borderRadius: 50,
              transform: [{ rotate: '297deg' }],
              position: 'absolute',
              marginTop: -45,
              marginLeft: 290,
              shadowColor:'#000',
              elevation:10,
            }}></View>
             <View style={{
              height: 150,
              width: 150,
              // borderWidth: 2,
               backgroundColor:'#fff',
              // borderColor: '#666',
              borderRadius: 50,
              transform: [{ rotate: '210deg' }],
              position: 'absolute',
              shadowColor:'#000',
              elevation:10,
              alignSelf:'auto',
              marginTop:500,
              marginLeft:-45              
            }}></View>

            <View style={{
              height: 150,
              width: 150,
              backgroundColor: '#592c87',
              borderRadius: 50,
              transform: [{ rotate: '220deg' }],
              position: 'absolute',
              shadowColor:'#000',
              elevation:10,
              alignSelf:'auto',
              marginTop:500,
              marginLeft:-60
            }}></View>
        

                <Text
                  style={{
                    fontSize:30,
                    fontWeight:"bold",
                    color:"#000",
                    marginTop:30,
                    marginBottom:80,
                    fontFamily:'Amiri-Bold',
                  }}>مرحبا بك</Text>






<ScrollView showsVerticalScrollIndicator={false}>
<View style={{
  
  width:'100%',
  // backgroundColor: '#fff',
  alignItems:'center',
 
}}>

  
  <TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({vismodalzaka:true})
  }}>

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>حساب الذكاة</Text>

</TouchableOpacity>
  

<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>حساب الميراث</Text>

</TouchableOpacity>

<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({Visaseeelaa:true})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}> الأسئلة الشائعه</Text>

</TouchableOpacity>

<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>مسائل متقدمة</Text>

</TouchableOpacity>

<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({Visactivitie:true})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>أنشطة الجمعية</Text>

</TouchableOpacity>

<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>اتصل  بنا</Text>

</TouchableOpacity>


<TouchableOpacity style={{
  height:80,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>تبرع معنا</Text>

</TouchableOpacity>


</View></ScrollView>












<Modal
 visible={this.state.vismodalzaka}
 onRequestClose={() => {
   this.setState({ vismodalzaka: false })
 }}>


<StatusBar backgroundColor="#592c87" barStyle="light-content" />
      
      <View style={{
         backgroundColor:'#fff',
        flex:1,
      //paddingHorizontal:20,
      //paddingTop:20,
        
       }}>
   
<View
style={{
 width:"100%",
 height:175,
 marginBottom:10,
 //backgroundColor:"#fd0"
}}>
<View style={{
           height:200,
           width:200,
           borderWidth:3,
         //  backgroundColor:'#666',
           borderColor:'#666',
           borderRadius:50,
           transform:[{rotate:'299deg'}],
           position:'absolute',
           marginTop:-50,
           opacity:.3,
           marginLeft:270
         }}></View>

          <View style={{
           height:200,
           width:200,
           backgroundColor:'#592c87',
           borderRadius:50,
           transform:[{rotate:'297deg'}],
           position:'absolute',
           marginTop:-45,
           marginLeft:290
         }}></View>


<View
style={{
  width:"60%",
  height:100,
// backgroundColor:"#0f0",
  marginTop:30,
 paddingHorizontal:20,
 alignItems:"center",
 justifyContent:"center"
}}>


 <Text
 style={{
  fontSize:25,
  fontWeight:"bold",
  color:"#000",
  marginBottom:10
 }}>إختر لحساب الزكاة</Text> 



</View>
</View>

<ScrollView>
<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,

}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20,
}}
onPress={()=>{
  this.setState({visMod_almal:true})
}}>


<Image source={photo12}
                        style={{
                               width: 50,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة المال</Text> 
</TouchableOpacity>


<TouchableOpacity
style={{
  width:"45%",
  borderRadius:20,
 flexDirection:"column",
 backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
}}

onPress={()=>{
  this.setState({visMod_altegara:true})
}}>

<Image source={photo13}
                        style={{
                               width: 50,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,

  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة التجارة</Text> 
</TouchableOpacity>
</View>



{/* ////////////////////////// */}




<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,
}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_alfatata:true})
}}>


<Image source={photo14}
                        style={{
                               width: 60,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الفضة</Text> 
</TouchableOpacity>
<TouchableOpacity
style={{
  width:"45%",
 flexDirection:"column",
 backgroundColor:"#FFF",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_alazahab:true})
           }}>


<Image source={photo15}
                        style={{
                               width: 70,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الذهب</Text> 
</TouchableOpacity>
</View>



{/* ////////////////////////// */}

<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,
}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
this.setState({visMod_almomtlakat:true})
}}>


<Image source={photo16}
                        style={{
                               width: 70,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:17,
  fontWeight:"400",
  color:"grey",
  opacity:.8
  }}>زكاة الممتلكات المؤجرة</Text> 
</TouchableOpacity>


<TouchableOpacity
style={{
  width:"45%",
 flexDirection:"column",
backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
 this.setState({visMod_almogaowhratat:true})
}}>


<Image source={photo17}
                        style={{
                               width: 70,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة المجوهرات</Text> 
</TouchableOpacity>
</View>


{/* //////////////// */}


<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,
}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
   backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
this.setState({visMod_alzare:true})
}}>


<Image source={photo18}
                        style={{
                               width: 55,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الزروع</Text> 
</TouchableOpacity>
<TouchableOpacity
style={{
  width:"45%",
 flexDirection:"column",
 backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_alestmaar:true})
}}>

<Image source={photo19}
                        style={{
                               width: 50,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:17,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الاستثمار العقارى</Text> 
</TouchableOpacity>
</View>


{/* /////////////////// */}


<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,
}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_almotkaet:true})
}}>


<Image source={photo20}
                        style={{
                               width: 70,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:22,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة مكافأة التقاعد</Text> 
</TouchableOpacity>
<TouchableOpacity
style={{
  width:"45%",
 flexDirection:"column",
 backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_alstaak:true})
}}>

<Image source={photo21}
                        style={{
                               width: 70,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:22,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الصداق</Text> 
</TouchableOpacity>
</View>

{/* /////////////////////// */}


<View
style={{
  width:"90%",
  alignSelf:"center",
 backgroundColor:"#fff",
  flexDirection:"row",
  justifyContent:"space-between",
  marginBottom:20,
}}>
<TouchableOpacity

style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}

onPress={()=>{
  this.setState({visMod_cow:true})
}}>      


<Image source={photo22}
                        style={{
                               width: 50,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:18,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة البقر والجاموس</Text> 
</TouchableOpacity>


<TouchableOpacity
style={{
  width:"45%",
 flexDirection:"column",
  backgroundColor:"#fff",
 alignItems:"center",
 shadowColor:'#000',
  elevation:15,
  borderRadius:20
}}
onPress={()=>{
  this.setState({visMod_mazza:true})
}}>

<Image source={photo23}
                        style={{
                               width:45,
                              height: 80,
                             resizeMode:"contain",
                           
                        }} />
<Text
 style={{
  fontSize:21,
  fontWeight:"500",
  color:"grey",
  opacity:.8
  }}>زكاة الغنم</Text> 
</TouchableOpacity>
</View>
</ScrollView>

    


<Modal
          visible={this.state.visMod_almal}
          onRequestClose={() => {
            this.setState({ visMod_almal: false })
          }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            onPress={()=>{
              this.setState({visMod_almal:false,value_to_calculate:0,final:0})
            }}>
            
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo12}
                style={{
                  width: 30,
                  height: 70,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة المال</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

                          
                       <TouchableOpacity
style={{
  backgroundColor: "#fff",
  width: '100%',
  height: 45,
  justifyContent:"space-between",
 flexDirection:"row",
 alignItems:"center",
  borderRadius: 10,
  color:'#000',
  marginVertical:15,
  marginTop:30,
  paddingHorizontal:15,
  FontFamily:'Almarai-Regular',
  fontSize:16,

}}
onPress={()=>{
 this.setState({itemcheck:true,modVis:true})
}}>

<Text
            style={{
              fontSize: 17,
         
              fontFamily: 'Almarai-Bold',
              color:"#666"
              
            }}>قم باختيار نوع المدخل</Text>

<Icon 
             
             name="angle-down" size={20} color="#666"/> 

</TouchableOpacity>

{/* ////////////////////////////// */}

{/* ////////////////////////////// */}

<ModalHome
isOpen={this.state.modVis}
onRequestClose={() => {
  this.setState({ 
    modVis: false 
  });
}}

style={{
 // height:'50%' ,
  marginTop:450,
  backgroundColor:"#fff"
}}

backButtonClose={true}
backdropPressToClose={true}

backdrop={true}

onClosed={()=>{

  this.setState({
    modVis: false
  })
}}
>
<View
style={{
  // width:"100%",
  // height:"60%",
  // backgroundColor:"#ff3",
  // marginTop:310,
  paddingHorizontal:20,
  paddingTop:20
}}>
<Text
 style={{
  fontSize: 25,
  fontWeight:"bold",
  color: '#000',
  fontFamily: 'Almarai-Bold',
   
}}>قم باختيار نوع الدخل</Text>


{this.state.itemcheck?(
  <>

{this.state.item_d.map((item,index)=>
<>

<TouchableOpacity
onPress={()=>{
  this.checked_1(index) 
  }}>
<View style={{
  width:'100%',
  backgroundColor:'#fff',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
 //backgroundColor:"#0ff",
 marginVertical:10,


}}>
  <Text style={{
    fontSize:16,
    fontFamily:'Amiri-Bold',
    color:'#000',
    alignSelf:"flex-end",
    marginHorizontal:8

  }}>{item.itemtext}</Text>

  <View style={{
    width:20,
    height:20,
    backgroundColor:this.state.item_d[index].itemshow?'#000':'#999',
    borderRadius:10, 
    
  }}>
  
</View>
  </View>
  </TouchableOpacity>
  </>
)}
  </>
 ):null} 

</View>
</ModalHome>

{/* ////////////////////////////// */}

{/* ////////////////////////////// */}

<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16,
              
             
              
            }}
            placeholder='ادخل القيمة الحالية'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
    
            
            



          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginTop: 25,
                fontFamily: 'Almarai-Regular',

              }}>لا تجب زكاة المال علي :</Text>
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. ديون معدومة لا يستطيع دفعها.</Text>
              <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. في حالة رجوع دين لا يرجي سداده يزكي عنه مرة عند رجوعه اذا مر عليه حول واحد او اكثر.</Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. في حالة وجود ديم تكون الزكاة علي من اقرض المال.</Text>
             


          </View>
    </View>
</Modal>

<Modal
          visible={this.state.visMod_altegara}
          onRequestClose={() => {
            this.setState({visMod_altegara: false })
          }}>


<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
           onPress={()=>{
            this.setState({visMod_altegara:false,value_to_calculate:0,final:0})
           }}>
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo13}
                style={{
                  width: 40,
                  height: 70,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة التجارة</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 17,
              color: "#000",
              fontFamily: 'Almarai-Regular',
              marginVertical:10

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

                          
                       <TouchableOpacity
style={{
  backgroundColor: "#fff",
  width: '100%',
  height: 45,
  justifyContent:"space-between",
 flexDirection:"row",
 alignItems:"center",
  borderRadius: 10,
  color:'#000',
  marginVertical:15,
  marginTop:30,
  paddingHorizontal:15,
  FontFamily:'Almarai-Regular',
  fontSize:16,

}}
onPress={()=>{
 this.setState({itemcheck3:true,modVis3:true})
}}>

<Text
            style={{
              fontSize: 17,
         
              fontFamily: 'Almarai-Bold',
              color:"#666"
              
            }}>قم باختيار نوع زكاة التجارة</Text>

<Icon 
             
             name="angle-down" size={20} color="#666"/> 

</TouchableOpacity>

{/* ////////////////////////////// */}

{/* ////////////////////////////// */}

<ModalHome
isOpen={this.state.modVis3}
onRequestClose={() => {
  this.setState({ 
    modVis3: false 
  });
}}

style={{
 // height:'50%' ,
  marginTop:450,
  backgroundColor:"#fff"
}}

backButtonClose={true}
backdropPressToClose={true}

backdrop={true}

onClosed={()=>{

  this.setState({
    modVis3: false
  })
}}
>


<View
style={{
  // width:"100%",
  // height:"60%",
 // backgroundColor:"#ff3",
 // marginTop:310,
 paddingHorizontal:20,
  paddingTop:20
}}>
<Text
 style={{
  fontSize: 25,
  fontWeight:"bold",
  color: '#000',
  fontFamily: 'Almarai-Bold',
   
}}>قم باختيار نوع زكاة التجارة</Text>


{this.state.itemcheck3?(
  <>

{this.state.item_d3.map((item3,index3)=>
<>

<TouchableOpacity
onPress={()=>{
  this.checked_3(index3) 
  }}>
<View style={{
  width:'100%',
  backgroundColor:'#fff',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
// backgroundColor:"#0ff",
 marginVertical:10,


}}>
  <Text style={{
    fontSize:16,
    fontFamily:'Amiri-Bold',
    color:'#000',
    alignSelf:"flex-end",
    marginHorizontal:8

  }}>{item3.itemtext3}</Text>

  <View style={{
    width:20,
    height:20,
    backgroundColor:this.state.item_d3[index3].itemshow3?'#000':'#999',
    borderRadius:10, 
    
  }}>
  
</View>
  </View>
  </TouchableOpacity>
  </>
)}
  </>
 ):null} 




</View>


</ModalHome>



{/* ////////////////////////////// */}

{/* ////////////////////////////// */}


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16,
              
             
              
            }}
            placeholder='ادخل القيمة الحالية '
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
  
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30,
              marginBottom:10
            }}
            onPress={()=>{
              this.calculate()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              
            }}>احسب</Text>
          </TouchableOpacity>

          {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
          //  backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",
              

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginTop: 25,
                fontFamily: 'Almarai-Regular',

              }}> اذا كان للتاجر ديون فهي تنقسم الي:</Text>
       
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. ديون مضمونةعند تجار أمناء فيجب عليه اخراج زكاة عنها.</Text>
              <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. ديون غير مضمونة فلا تجب عليها زكاة.</Text>
            
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. أما اذا كان هو المستدين فزكاة هذا المال تقع علي من اقرضه المال.</Text>

</View>
 </View>
 </Modal>

 <Modal
 visible={this.state.visMod_alfatata}
 onRequestClose={() => {
   this.setState({visMod_alfatata:false})
 }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            
            onPress={()=>{
              this.setState({visMod_alfatata:false,value_to_calculate:0,final:0})
            }}>
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo14}
                style={{
                  width: 40,
                  height: 80,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة الفضه</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

         


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
             
              
            }}
            placeholder='ادخل القيمة الحالية للفضة'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
    
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }} >
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
         //   backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 25,

                fontFamily: 'Almarai-Regular',

              }}>فضة النساء للزينه فيها قولان</Text>

<Text
              style={{
                fontSize: 16,
                color: "#666",
                fontFamily: 'Almarai-Regular',

              }}>1- لا زكاة فيه : و هو قول جمهور العلماءعند الامام مالك و الليث و الشافعى و الإمام احمد و روى عن ذلك عائشه و اسماء و عبد الله ابن عمر و انس و جابر رضى الله عنهم ز</Text>
                <Text
              style={{
                fontSize: 16,
                color: "#666",
                fontFamily: 'Almarai-Regular',

              }}>2- فية زكاة : عند عمر بن الخطاب و ابن مسعود و ابن عباس و جماعة من التابعين و هو مذهب ابي حنيفه و الثوري و الازوعي .</Text>

          </View>
    </View>
 </Modal>

 <Modal
 visible={this.state.visMod_alazahab}
 onRequestClose={() => {
   this.setState({visMod_alazahab:false})
 }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            onPress={()=>{
   this.setState({visMod_alazahab:false,value_to_calculate:0,final:0})
            }}>
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo15}
                style={{
                  width: 40,
                  height: 70,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 19,
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة الذهب</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

                          
                       <TouchableOpacity
style={{
  backgroundColor: "#fff",
  width: '100%',
  height: 45,
  justifyContent:"space-between",
 flexDirection:"row",
 alignItems:"center",
  borderRadius: 10,
  color:'#000',
  marginVertical:15,
  marginTop:30,
  paddingHorizontal:15,
  FontFamily:'Almarai-Regular',
  fontSize:16,

}}
onPress={()=>{
 this.setState({itemcheck2:true,modVis2:true})
}}>

<Text
            style={{
              fontSize: 17,
         
              fontFamily: 'Almarai-Bold',
              color:"#666"
              
            }}>قم باختيار نوع المعيار</Text>

<Icon 
             
             name="angle-down" size={20} color="#666"/> 

</TouchableOpacity>

{/* ////////////////////////////// */}

{/* ////////////////////////////// */}
 
 
<ModalHome
isOpen={this.state.modVis2}
onRequestClose={() => {
  this.setState({ 
    modVis2: false 
  });
}}

style={{
 // height:'50%' ,
  marginTop:450,
  backgroundColor:"#fff"
}}

backButtonClose={true}
backdropPressToClose={true}

backdrop={true}

onClosed={()=>{

  this.setState({
    modVis2: false
  })
}}>

<View
style={{
  // width:"100%",
  // height:"60%",
  // backgroundColor:"#ff3",
  // marginTop:310,
   paddingHorizontal:20,
  paddingTop:20
}}>
<Text
 style={{
  fontSize: 25,
  fontWeight:"bold",
  color: '#000',
  fontFamily: 'Almarai-Bold',
   
}}>قم باختيار نوع المعيار</Text>


{this.state.itemcheck2?(
  <>

{this.state.item_d2.map((item2,index2)=>
<>

<TouchableOpacity
onPress={()=>{
  this.checked_2(index2) 
  }}>
<View style={{
  width:'100%',
  backgroundColor:'#fff',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
 //backgroundColor:"#0ff",
 marginVertical:10,


}}>
  <Text style={{
    fontSize:16,
    fontFamily:'Amiri-Bold',
    color:'#000',
    alignSelf:"flex-end",
    marginHorizontal:8

  }}>{item2.itemtext2}</Text>

  <View style={{
    width:20,
    height:20,
    backgroundColor:this.state.item_d2[index2].itemshow2?'#000':'#999',
    borderRadius:10, 
    
  }}>
  
</View>
  </View>
  </TouchableOpacity>
  </>
)}
  </>
 ):null} 

</View>

</ModalHome>




{/* ////////////////////////////// */}

{/* ////////////////////////////// */}


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16,
              
             
              
            }}
            placeholder='ادخل القيمة عدد الجرامات'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
  
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30,
              marginBottom:10
            }}
            onPress={()=>{
              this.calculate_dahab()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              
            }}>احسب</Text>
          </TouchableOpacity>





          {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

<ScrollView>
  
<View
      style={{
        marginBottom:30
      }}> 
          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",
              

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginTop: 25,
                fontFamily: 'Almarai-Regular',

              }}>يتم حساب النصاب كالتالي:</Text>
       
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. نصاب الذهب عيار 18 هو ما يساوي 113 جرام* سعر الجرب بسعر اليوم</Text>
              <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. نصاب الذهب عيار21هو ما يساوي97 جرام* سعر الجرم بسعر اليوم.</Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. نصاب الذهب عيار24هو ما يساوي84 جرام* سعر الجرم بسعر اليوم.</Text>
             
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>تجب الزكاةعند بلوغ النصاب وحلول الحول(اي مرور عام علي حوزة هذا المدخر)</Text>
             
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>النصاب قد يكون:</Text>
               <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. من نوع واحد مثل(الاموال او الذهب).</Text>

<Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>.أو مجموع المدخرات</Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>مثل:</Text>

<Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',
                
              }}>(50جرام ذهب عيار 21+40 ألف جنبيه+30 جرام ذهب عيار 18) يتم جمع قيمه المدخرات ومقارنتها بالنصاب</Text>
</View>
          </View>
    </ScrollView>

    </View>


 </Modal>

 <Modal
 visible={this.state.visMod_almomtlakat}
 onRequestClose={() => {
   this.setState({visMod_almomtlakat:false})
 }}>



<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            onPress={()=>{
              this.setState({visMod_almomtlakat:false,value_to_calculate:0,final:0})
              }}>
            
          
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo16}
                style={{
                  width: 40,
                  height: 80,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 18,
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة الممتلكات المؤجرة</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 17,
              color: "#000",
              fontFamily: 'Almarai-Regular',
              marginVertical:10

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>
<Text

style={{
  fontSize: 18,
  fontFamily:"600",
  color: "#000",
  fontFamily: 'Almarai-Regular',
  marginVertical:10

}}>قم باختيار نوع الايجار</Text>
          

<View
style={{
 width:"80%",
 flexDirection:"row",
 justifyContent:"space-between"
}}>

<View style={{
 // backgroundColor:'#ff0f',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
  marginVertical:15,
  opacity:0.9,


}}>

  <Text style={{
    fontSize:15,
    fontFamily:'Amiri-Bold',
    color:'#000',
    marginHorizontal:8

  }}>شهري</Text>

  <TouchableOpacity style={{
    width:25,
    height:25,
    backgroundColor:this.state.itemshow6?'#000':'#999',
    alignSelf:'center',
    borderRadius:12.5,
  }}
  onPress={()=>{
  
  this.setState({itemshow6:true,itemshow7:false})
   
  }}>
  </TouchableOpacity>
  </View>


  <View style={{

 // backgroundColor:'#f0d',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
  marginVertical:15,
  opacity:0.9,


}}>
  
  <Text style={{
    fontSize:15,
    fontFamily:'Amiri-Bold',
    color:'#000',
    marginHorizontal:8

  }}>سنوي</Text>

  <TouchableOpacity style={{
    width:25,
    height:25,
    backgroundColor:this.state.itemshow7?'#000':'#999',
    alignSelf:'center',
    borderRadius:12.5,
  }}
  onPress={()=>{
  
    this.setState({itemshow6:false,itemshow7:true})
   
  }}>
  </TouchableOpacity>
  </View>
  </View>


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
              
            }}
            placeholder='ادخل قيمة الايجار  '
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
     
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>



          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 25,

                fontFamily: 'Almarai-Regular',

              }}>اذا لم يتم صرف الايجار وحال عليه الحول يجب اخراج زكاة ولكن اذا صرف المبلغ أول بأول يجب عدم احراجها</Text>
           
          </View>
    </View>
</Modal>

<Modal
 visible={this.state.visMod_alzare}
 onRequestClose={() => {
   this.setState({visMod_alzare:false})
 }}>




<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            
            onPress={()=>{
              this.setState({visMod_alzare:false,value_to_calculate:0,final:0})
              }}>      
            
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo18}
                style={{
                  width: 30,
                  height: 70,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 18,
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة الحبوب والثمار</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>



<View style={{
  width:'100%',
  backgroundColor:'#fff',
  paddingHorizontal:10,
  flexDirection:"row-reverse",
  alignItems:"flex-end",
  justifyContent:"flex-end",
  marginVertical:15,
  opacity:0.9,


}}>
  <Text style={{
    fontSize:15,
    fontFamily:'Amiri-Bold',
    color:'#000',
    marginHorizontal:8

  }}>استخدم لزراعتها معدات وايدي عاملة</Text>

  <TouchableOpacity style={{
    width:22,
    height:22,
    backgroundColor:this.state.itemshow9?'#000':'#999',
    alignSelf:'center',
    borderRadius:5,
  }}
  onPress={()=>{
  
  this.setState({itemshow9 : !this.state.itemshow9})
   
  }}>
  </TouchableOpacity>
  </View>


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
              
            }}
            placeholder='ادخل قيمة المحصول  '
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
     
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate_zare()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 25,

                fontFamily: 'Almarai-Regular',

              }}>تجب عند الحصاد للحبوب والثمار</Text>
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>يتم تقدير قيمتها المالية الحالية وحساب زكاة المال عليها</Text>
              <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. زكاة الزروع يمكن اخراجها من المحصول في صورة حبوب ويمكن اخراجها مال بما يعادل قيمة الزكاة</Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. اذا ساوي او زاد المحصول عن 5او سق اي ما يعادل 653 كيلو جرام لقوله صل الله عليه وسلم (ليس فيما دون خمسة اوسق صدقة)</Text>
            

          </View>



    </View>



 </Modal>




 <Modal
 visible={this.state.visMod_almogaowhratat}
 onRequestClose={() => {
   this.setState({visMod_almogaowhratat:false})
 }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
             onPress={()=>{
              this.setState({visMod_almogaowhratat:false,value_to_calculate:0,final:0})
            }}>
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo17}
                style={{
                  width: 40,
                  height: 80,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة المجوهرات</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

         


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
             
              
            }}
            placeholder='ادخل القيمة الحالية للمجوهرات'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
    
            
            



          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}
          >
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>
            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}


          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 25,

                fontFamily: 'Almarai-Regular',

              }}>تجب الزكاة عليها إذا كانت معده للإتجار مثل : الذهب و الألماظ و الؤلؤ و أي أحجار كريمة .</Text>

<Text
              style={{
                fontSize: 16,
                color: "#666",
                fontFamily: 'Almarai-Regular',

              }}>1- لا زكاةفيه : و هو قول جمهور العلماءعند الامام مالك و الليث و الشافعى و الإمام احمد و روى عن ذلك عائشه و اسماء و عبد الله ابن عمر و انس و جابر رضى الله عنهم ز</Text>
                <Text
              style={{
                fontSize: 16,
                color: "#666",
                fontFamily: 'Almarai-Regular',

              }}>2- فية زكاة : عند عمر بن الخطاب و ابن مسعود و ابن عباس و جماعة من التابعين و هو مذهب ابي حنيفه و الثوري و الازوعي .</Text>
          </View>
    </View>
 </Modal>

 <Modal
 visible={this.state.visMod_alestmaar}
 onRequestClose={() => {
   this.setState({visMod_alestmaar: false })
 }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
           onPress={()=>{
             this.setState({visMod_alestmaar: false,value_to_calculate:0,final:0})
           }}>
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo19}
                style={{
                  width: 30,
                  height: 70,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:10,
                  fontFamily:'Almarai-Bold'


                }}>احسب زكاة الاستثمار العقاري</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

         


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:30,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
             
              
            }}
            placeholder='ادخل القيمة الحالية للعقار'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
     
          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}
          >
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 20,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 25,

                fontFamily: 'Almarai-Regular',

              }}>لا تجب الزكاة في</Text>
            <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. البيوت : سكن او ترفيه او مصيف</Text>
              <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. السيارات : ركوب او نقل </Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. محلات</Text>
             <Text
              style={{
                fontSize: 16,
                color: "#666",
                marginLeft:5,
                fontFamily: 'Almarai-Regular',

              }}>. ارض ميراث : غير زراعيه او غير مستخدمة للاستثمار</Text>
          </View>
    </View>
 </Modal>




 <Modal
 visible={this.state.visMod_almotkaet}
 onRequestClose={() => {
   this.setState({visMod_almotkaet:false})
 }}>
  <View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
            onPress={()=>{
              this.setState({visMod_almotkaet:false,value_to_calculate:0,final:0})
            }}>
            
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo20}
                style={{
                  width: 40,
                  height: 80,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:5,
                  fontFamily:'Almarai-Bold'
                }}>احسب زكاة مكافأة التقاعد</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

          <Text
            style={{
              fontSize: 16,
              color: "#592c87",
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              marginVertical:20

            }}>***تدفع الزكاةعنه مرة واحدة***</Text>


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:20,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
             
              
            }}
            placeholder='ادخل قيمة مكافأة التقاعد'
            placeholderTextColor='#666'
             value={(this.state.value_to_calculate)}
             onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
    
            
            



          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
            <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
           // backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 15,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                
                marginTop: 20,

                fontFamily: 'Almarai-Regular',

              }}>يزكى عنها لسنة واحدة</Text>
          </View>
    </View>
 </Modal>





 <Modal
 visible={this.state.visMod_alstaak}
 onRequestClose={() => {
   this.setState({visMod_alstaak:false })
 }}>

<View style={{
      width:'100%',
      height:'100%',
      backgroundColor:'#fff',
      paddingHorizontal:30,
      paddingVertical:30

    }}>
          <View style={{
            width: '100%',
            height: 100,
            justifyContent:'space-between',
            // backgroundColor: '#f00',
            

          }}>
            <TouchableOpacity
             onPress={()=>{
              this.setState({visMod_alstaak:false,value_to_calculate:0,final:0})
            }}>
            
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  alignSelf: 'flex-start',
                }} />
            </TouchableOpacity>
            <View
              style={{
                flexDirection: "row",
                alignItems:'center',
                
              }}>

              <Image source={photo21}
                style={{
                  width: 40,
                  height: 80,
                  marginLeft:-5,
                  resizeMode: "contain",
                }} />
              <Text
                style={{
                  fontSize: 22,
                  fontWeight:"800",
                  color: "#000",
                  marginLeft:5,
                  fontFamily:'Almarai-Bold'

                }}>احسب زكاة الصداق</Text>
            </View>



          </View>
          <Text
            style={{
              fontSize: 16,
              color: "#666",
              fontFamily: 'Almarai-Regular'

            }}>قم بحساب الزكاة من خلال ملأ البيانات التالية</Text>

          <Text
            style={{
              fontSize: 16,
              color: "#592c87",
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',
              marginVertical:20

            }}>***تدفع الزكاةعنه مرة واحدة***</Text>


<TextInput 
            style={{
              backgroundColor: "#fff",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 10,
              color:'#000',
              marginVertical:15,
              marginTop:20,
              paddingHorizontal:15,
              FontFamily:'Almarai-Regular',
              fontSize:16
             
              
            }}
            placeholder='ادخل قيمة الصداق (المهر)'
            placeholderTextColor='#666'
            value={(this.state.value_to_calculate)}
            onChangeText={(newval)=>{
             this.setState({value_to_calculate:newval})
            }}></TextInput>
           
    
            
            



          <TouchableOpacity
            style={{
              backgroundColor: "#592c87",
              width: '100%',
              height: 45,
              justifyContent: 'center',
              alignItems: 'center',
              borderRadius: 30
            }}
            onPress={()=>{
              this.calculate()
            }}>
            <Text
            style={{
              fontSize: 16,
              color: '#fff',
              alignSelf:'center',
              fontFamily: 'Almarai-Bold',

            }}>احسب</Text>
             
            </TouchableOpacity>

            {this.state.final==0?null:(
  <>
          <View style={{
            flexDirection: 'row',
            justifyContent: 'space-between',
            width: '100%',
            alignItems: 'center',
            height: 45,
            marginTop: 20,
        //    backgroundColor:'#000'
          }}>
            <Text
              style={{
                fontSize: 20,
                color: '#592c87',
                textAlign: 'right',
                fontFamily: 'Almarai-Bold',


              }}>قيمة الزكاة</Text>


            <View
              style={{
                backgroundColor: "#e6e1ec",
                width: '60%',
                height: 45,
                justifyContent: 'center',
                alignItems: 'center',
                borderRadius: 30,

              }}>
              <Text
                style={{
                  fontSize: 16,
                  color: '#592c87',
                  alignSelf: 'center',
                  fontFamily: 'Almarai-Bold',


                }}>{this.state.final}</Text>

            </View></View>
</>
)}

          <View
            style={{
              width: "100%",
              height: 45,
              backgroundColor: "#fff7f0",
              alignSelf: "center",
              alignItems:'center',
              paddingHorizontal:'4%',
              marginTop: 15,
              borderRadius: 15,
              flexDirection: "row",

            }}>

            <View
     

             style={{ 
            backgroundColor:"#c58157",
            width:22,
            height:22,
            borderRadius:11,
            alignItems:'center',
            justifyContent:'center',

             }}>
              
            <Text
            style={{
              fontSize: 15,
              fontFamily: 'Almarai-Regular',

              color: '#fff',


            }}>i</Text></View>


            <Text
              style={{
                fontSize: 16,
                fontFamily: 'Almarai-Bold',
                color: "#c58157",
                alignSelf: "center",
                marginLeft: '4%'
              }}>ملاحظات</Text>
          </View>

          <View
            style={{
              width: "90%",
              height: 340
            }}>


            <Text
              style={{
                fontSize: 16,
                color: "#666",
                alignSelf: "center",
                marginTop: 20,

                fontFamily: 'Almarai-Regular',

              }}>هو مهر الزواج للمرأه إن قبضته و بلغ النصاب و حال عليه الحول تدفع الزكاة مرة واحدة</Text>
          </View>
    </View>
 </Modal>

 <Modal
 visible={this.state.visMod_cow}
 onRequestClose={() => {
   this.setState({visMod_cow: false })
 }}>

<View
          style={{
            flex: 1,
            backgroundColor: "#ffffff",
            paddingHorizontal:20,
            paddingTop:20,
          }}>

          <View
            style={{
    
   // backgroundColor:"#0f0",
   alignItems:"flex-start",
    flexDirection:"column",
            }}>


            <TouchableOpacity
       onPress={()=>{
        this.setState({visMod_cow:false})
      }}>      
            
              <Icon

                name="arrow-right" size={15} color="#000"

                style={{
                  marginLeft:10
                }} />
 </TouchableOpacity>


            <View
              style={{

marginVertical:20,
 flexDirection:"row",
// backgroundColor:"#0FF",
              }}>

 <Image source={photo22}
              style={{
                  width: 30,
                  height: 30,
                  resizeMode: "contain",
            //      backgroundColor:"#00f"

                  
                }} />
              <Text
                style={{
              
                  fontSize:22,
                  fontWeight:"800",
                //  marginTop:30,
                  marginLeft:10,
                  color:"#000"

                }}>احسب زكاة البقر و الجاموس</Text>
            </View>
          </View>


<ScrollView showsVerticalScrollIndicator={false}>         
<View>
          <Text style={{
            color:'#000',
            fontSize:23,
            fontWeight:"600",
            alignSelf:"center",
          
          }}>الجول التوضيحى</Text>
          <Text style={{
           fontSize:21,
           fontWeight:"400",
           alignSelf:"center",
           color:"#a7a7a7",
          //  marginTop:5
          marginVertical:10
          }}>جدول توضيحى لحساب زكاة البقر و الجاموس </Text>
  

         <View style={{
          width:'100%',
          borderColor:'#592c87',
          borderWidth:1,
          borderRadius:30,
          marginTop:5,
      //    backgroundColor:"#00f"

         }}>
                
                <View
                  style={{
                    flexDirection: "row",

                  }}>

                  <View
                    style={{
                      width: "50%",
                      height: 60,
                      backgroundColor: "#e6e1ec",
                      borderTopLeftRadius: 30,
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,

                    }}>
                    <Text
                      style={{
                        fontSize: 23,
                        fontWeight: "600",
                        color: "#492e72",
                        
                      }}>الروؤس المملوكة</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      backgroundColor: "#e6e1ec",
                      alignItems: "center",
                      justifyContent:'center',
                      borderTopRightRadius: 30,
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 23,
                        fontWeight: "600",
                        color: "#492e72",
                      }}>مقدار الزكاة </Text>
                  </View>
                </View>


                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 1:29 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>ليس فيها زكاة</Text>
                  </View>
                </View>


                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 30:39 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأس عمره سنه</Text>
                  </View>
                </View>





                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 40:59 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأس عمره سنتين</Text>
                  </View>
                </View>



                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 60:69 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأسان عمرهم سنه</Text>
                  </View>
                </View>




                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 70:79 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأس عمره سنه +رأس عمره سنتين</Text>
                  </View>
                </View>

                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 80:89 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize:18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأسان عمرهم سنتين</Text>
                  </View>
                </View>

                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 90:99 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>3 رؤوس عمرهم سنه</Text>
                  </View>
                </View>

                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                    }}>
                    <Text
                      style={{
                        fontSize:18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 100:109 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>رأسان عمرهما سنه+رأس عمرها سنتين</Text>
                  </View>
                </View>
              </View>


              <View
                style={{
                  width: "100%",
                  paddingHorizontal:10,
                  paddingVertical:10,
                  backgroundColor: "#edddd4",
                  alignSelf: "center",
                  marginVertical: 15,
                  borderRadius: 15,
                  flexDirection: "row",
                 

                }}>

                <Icon

                  name="circle" size={28} color="#c27249ff"

                  style={{
                   
                    alignSelf:'center',                  }} 
                 />
                <Text
                  style={{
                    fontSize: 20,
                    fontWeight: "bold",
                    color: "#c58157",
                    marginLeft:-17,
                    marginTop:2,
                    textAlign:'center',
                  }}>!</Text>

                <Text
                  style={{
                    fontSize: 25,
                    fontWeight: "bold",
                    color: "#c58157",
                    marginLeft: 20
                  }}>ملاحظات</Text>
              </View>



              <Text
                style={{
                  fontSize: 20,
                  color: "#989898",
                  marginTop: 10,
                  

                }}>•تجب زكاة الحيوانات على المواشي التي ترعى في العشب النابت دون قصد زراعته لرعيها</Text>


              <Text
                style={{
                  fontSize: 20,
                  color: '#989898',
                  marginTop: 10,
        

                }}> •اما اذا كانت ترعى في مزرعة تم زراعتها من اجلها او يتم تسمينها فهي تدخل في زكاة الأموال</Text>


              <Text
                style={{
                  fontSize: 20,
                  color: "#989898",

                  marginTop: 10,
                 

                }}>• زكاة الماشية يمكن إخراجها من الماشية ويمكن إخراجها مال بما يعادل قيمة الزكاة</Text>

              <Text
                style={{
                  fontSize: 20,
                  color: "#989898",
                  marginVertical:10,
                  

                }}>• في حالة تسمين الحيواني يتم معاملتها كمعاملة زكاة المال ، أي عندما يمر عليها الحول وبلغت النصاب يتم تقدير المملوك من الرؤوس على حسب السوق الحالي ويتم دفع زكاتها مال</Text>

         </View></ScrollView>
          </View>
</Modal>

<Modal
 visible={this.state.visMod_mazza}
 onRequestClose={() => {
   this.setState({visMod_mazza: false })
 }}>

<View
style={{
  flex:1,
  backgroundColor:"#ffffff",
  paddingHorizontal: 20,
  paddingTop:20,
}}>

<View
style={{
    width:"60%",
    height:80,
   // backgroundColor:"#0f0",
   alignItems:"flex-start",
    flexDirection:"column",
}}>


<TouchableOpacity
 onPress={()=>{
  this.setState({visMod_mazza:false})
}}>

<Icon 
             
             name="arrow-right" size={15} color="#000"

             style={{
              marginLeft:10
              }}/> 
</TouchableOpacity>


<View
style={{
  
marginVertical:20,
 flexDirection:"row",
 //backgroundColor:"#0FF",
 

}}>

<Image source={photo23}
                        style={{
                               width: 30,
                              height: 30,
                             resizeMode: "contain",
                         //    backgroundColor:"#00f"
                        }} />
<Text
style={{
  fontSize:22,
  fontWeight:"800",
 // marginTop:30,
  marginLeft:10,
  color:"#000",

}}>احسب زكاة الغنم</Text>
</View>
</View>    


<ScrollView   showsVerticalScrollIndicator={false}>
<View>
<Text
style={{
  fontSize:23,
  fontWeight:"600",
  alignSelf:"center",
  color:"#000",
  
}}>الجدول التوضيحي</Text>

<Text
style={{
  fontSize:21,
  fontWeight:"400",
  alignSelf:"center",
  color:"#a7a7a7",
  marginVertical:10
}}>جدول توضيحي لحساب زكاة الغنم</Text>



<View style={{
          width:'100%',
          borderColor:'#592c87',
          borderWidth:1,
          borderRadius:30,
         marginTop:5,
      //    backgroundColor:"#f0f",
     //marginVertical:5

         }}>
                
                <View
                  style={{
                    flexDirection: "row",

                  }}>

                  <View
                    style={{
                      width: "50%",
                      height: 60,
                      backgroundColor: "#e6e1ec",
                      borderTopLeftRadius: 30,
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,

                    }}>
                    <Text
                      style={{
                        fontSize: 23,
                        fontWeight: "600",
                        color: "#492e72",
                        
                      }}>الروؤس المملوكة</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      backgroundColor: "#e6e1ec",
                      alignItems: "center",
                      justifyContent:'center',
                      borderTopRightRadius: 30,
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 23,
                        fontWeight: "600",
                        color: "#492e72",
                      }}>مقدار الزكاة </Text>
                  </View>
                </View>



                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",
                //   backgroundColor:"#ff0",
                  }}>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                      
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 39:1 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>ليس فيها زكاة</Text>
                  </View>
                </View>


                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 120:40 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>شاه واحدة</Text>
                  </View>
                </View>





                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 200:121 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                     
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>شاتان</Text>
                  </View>
                </View>



                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                      

                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 399:201 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                      
                    }}>
<View
style={{

  flexDirection:"row",
   marginVertical: 10,
  // backgroundColor:"#ff0"

}}>

 <Text
style={{
  fontSize:18,
  color:"#666",
  }}> 3</Text>

<Text
style={{
  fontSize:18,
  color:"#666",
}}>شياه</Text>

</View>
</View>
</View>




                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 70:79 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                      borderBottomWidth: 1,
                    }}>
<View
style={{
  flexDirection:"row",
   marginVertical: 10,
 // backgroundColor:"#ff0",
}}>

 <Text
style={{
  fontSize:18,
  color:"#666",
  }}> 4</Text>

<Text
style={{
  fontSize:18,
  color:"#666",
}}>شياه</Text>

</View>
                  </View>
                </View>

                
                <View
                  style={{
                    flexDirection: "row",
                    justifyContent: "space-between",

                  }}>
                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      justifyContent:'center',
                      borderRightWidth: 1,
                      borderRightColor: '#492e72',
                      borderBottomColor: "#492e72",
                    //  borderBottomWidth: 1,
                      
                    }}>
                    <Text
                      style={{
                        fontSize: 18,
                        color: "#666",
                        marginVertical: 10
                      }}>من 599:500 رأس</Text>
                  </View>

                  <View
                    style={{
                      width: "50%",
                      alignItems: "center",
                      borderBottomColor: "#492e72",
                   //   borderBottomWidth: 1,
                    }}>
                 <View
style={{
  flexDirection:"row",
   marginVertical: 10,
 // backgroundColor:"#ff0",
}}>

 <Text
style={{
  fontSize:18,
  color:"#666",
  }}> 5</Text>

<Text
style={{
  fontSize:18,
  color:"#666",
}}>شياه</Text>

</View>
</View>
</View>
</View>

<View
                style={{
                  width: "100%",
                  paddingHorizontal:10,
                  paddingVertical:10,
                  backgroundColor: "#edddd4",
                  alignSelf: "center",
                  marginVertical: 15,
                  borderRadius: 15,
                  flexDirection: "row",
                 

                }}>

                <Icon

                  name="circle" size={28} color="#c27249ff"

                  style={{
                   
                    alignSelf:'center',                  }} 
                 />
                <Text
                  style={{
                    fontSize: 20,
                    fontWeight: "bold",
                    color: "#c58157",
                    marginLeft:-17,
                    marginTop:2,
                    textAlign:'center',
                  }}>!</Text>

                <Text
                  style={{
                    fontSize: 25,
                    fontWeight: "bold",
                    color: "#c58157",
                    marginLeft: 20
                  }}>ملاحظات</Text>
              </View>




<Text
                style={{
                  fontSize: 20,
                  color: "#989898",
                  marginTop: 10,
                  

                }}>•تجب زكاة الحيوانات على المواشي التي ترعى في العشب النابت دون قصد زراعته لرعيه</Text>


              <Text
                style={{
                  fontSize: 20,
                  color: '#989898',
                  marginTop: 10,
        

                }}> •اما اذا كانت ترعى في مزرعة تم زراعتها من اجلها او يتم تسمينها فهي تدخل في زكاة الأموال</Text>


              <Text
                style={{
                  fontSize: 20,
                  color: "#989898",

                  marginTop: 10,
                 

                }}>•زكاة الماشية يمكن اخراجها من الماشية ويمكن اخراجها من مال بما يعادل قيمة الزكاة  </Text>

              <Text
                style={{
                  fontSize: 20,
                  color: "#989898",
                  marginVertical:10,
                  

                }}>• في  حالة التسمين الحيواني يتم معاملتها كمعاملة زكاة المال, وأي عندما يمر عليها الحول وبلغت النصاب يتم تقدير المملوك من الرؤوس علي حسب السوق الحالي ويتم دفع زكتها مال</Text>



 </View>
</ScrollView>
</View>
</Modal>

</View>

</Modal>

{/* {dfsdfgsdgxdcgxg}
{

xkczklxvxmv.


} */}

<Modal
visible={this.state.Visaseeelaa}
onRequestClose={() => {
  this.setState({ Visaseeelaa: false })
}}>

<View style={{
          height: '100%',
          width: '100%',
          backgroundColor: '#fff',
          paddingHorizontal: 20,
          paddingVertical: 20
        }}>
            <View style={{
              height: 200,
              width: 200,
              // borderWidth: 2,
               backgroundColor:'#fff',
              // borderColor: '#666',
              borderRadius: 50,
              transform: [{ rotate: '299deg' }],
              position: 'absolute',
              marginTop: -50,
              marginLeft: 270,
              shadowColor:'#000',
              elevation:10,
            }}></View>

            <View style={{
              height: 200,
              width: 200,
              backgroundColor: '#592c87',
              borderRadius: 50,
              transform: [{ rotate: '297deg' }],
              position: 'absolute',
              marginTop: -45,
              marginLeft: 290,
              shadowColor:'#000',
              elevation:10,
            }}></View>
             <View style={{
              height: 150,
              width: 150,
              // borderWidth: 2,
               backgroundColor:'#fff',
              // borderColor: '#666',
              borderRadius: 50,
              transform: [{ rotate: '210deg' }],
              position: 'absolute',
              shadowColor:'#000',
              elevation:10,
              alignSelf:'auto',
              marginTop:500,
              marginLeft:-45              
            }}></View>

            <View style={{
              height: 150,
              width: 150,
              backgroundColor: '#592c87',
              borderRadius: 50,
              transform: [{ rotate: '220deg' }],
              position: 'absolute',
              shadowColor:'#000',
              elevation:10,
              alignSelf:'auto',
              marginTop:500,
              marginLeft:-60
            }}></View>

               




<View
 style={{
  
 width:"100%",
  backgroundColor: '#fff',
  alignItems:'center',
  alignSelf:"center",
 marginTop:200
  
  
}}>

  
  <TouchableOpacity style={{
  height:90,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({Visaselazaka:true})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>أسئلة شائعة عن الذكاة</Text>

</TouchableOpacity>
 

<TouchableOpacity style={{
  height:90,
  width:'80%',
  backgroundColor: '#fff',
  borderRadius:20,
  shadowColor:'#000',
  elevation:15,
  justifyContent:'center',
  alignItems:'center',
  marginVertical:10
  
  
  }}  
  onPress={()=>{
    this.setState({Visaselalmras:true})
  }}
  >

  <Text style={{
    fontSize:25,
    color:'#592c87',
    fontFamily:'Amiri-Bold',

  }}>أسئلة شائعة عن الميراث</Text>

</TouchableOpacity>

</View>


<Modal
visible={this.state.Visaselazaka}
onRequestClose={()=>{
this.setState({Visaselazaka:false})
}}>


<View style={{
          width: '100%',
          height: '100%',
          backgroundColor: '#fff',
          alignContent: 'center',
          paddingHorizontal: 20,
          paddingTop:20,
        }}>
          <TouchableOpacity
          onPress={()=>
      {this.setState({Visaselazaka:false})
    }}
          >
            <Icon

              name="arrow-right" size={20} color="#000"

              style={{
                marginLeft:10,
                alignSelf:'flex-start',
              }} />
          </TouchableOpacity>
          <View
            style={{
              flexDirection: "row",
              // backgroundColor:'#000',
              alignItems:'center',
            
            }}>

            <View style={{
              backgroundColor:'#592c87',
              height:30,
              width:30,
              borderRadius:15,
              alignItems:'center',
              justifyContent:'center',

            }}>
               <Text
              style={{
                fontSize: 22,
                fontWeight: "800",
                color: "#fff"

              }}>؟</Text>


            </View>
            <Text
              style={{
                fontSize: 22,
                fontWeight: "800",
                marginVertical: 20,
                marginLeft: 10,
                color: "#000"

              }}>الأسئله الشائعه</Text>
          </View>
               
  

 <ScrollView showsVerticalScrollIndicator={false}> 
  <View>  
{this.state.arraseal.map((item,index)=>
<>


<View style={{
  width:'100%',
  backgroundColor:this.state.arraseal[index].itemcheck?'#e6e1ec':'#592c87',
  alignSelf:'center',
  justifyContent:'center',
  paddingHorizontal:20,
  paddingVertical:20,
  justifyContent:'space-between',
  flexDirection:'row',
  borderRadius:20,
  marginVertical:10,
  
}}>
  <Text style={{
    fontSize:18,
    color:this.state.arraseal[index].itemcheck?'#592c87':'#fff',
    alignSelf:'center'
  }}>{item.itemName}</Text>
  <TouchableOpacity style={{
    width:22,
    height:22,
    borderColor:this.state.arraseal[index].itemcheck?'#592c87':'#e6e1ec',
    borderWidth:2,
    alignSelf:'center',
    justifyContent:'center',
    borderRadius:7,

  }}
  onPress={()=>{
    this.checked1(index)
  }}
  >
    <Text style={{
    fontSize:18,
    color:'#592c87',
    alignSelf:'center',
    marginTop:-5,
  }}>-</Text> 
   
  </TouchableOpacity>

</View>
{item.itemcheck?(
  <>
<View style={{
  
  width:'100%',
  backgroundColor:'#fff',
  alignSelf:'center',
  paddingHorizontal:10,
  paddingVertical:10,
  justifyContent:'space-between',


}}>
{this.state.arraseal[index].item_d1.map((itemm,indexx)=>
  <Text style={{
    fontSize:17,
    color:'#a7a7a7',
    marginBottom:10,
  }}>{itemm.answer}</Text>
 
  )}
  </View>

  </>
 ):null} 
  </>

)}

</View></ScrollView>
</View> 

</Modal>






<Modal
visible={this.state.Visaselalmras}
onRequestClose={()=>{
this.setState({Visaselalmras:false})
}}>


<View style={{
          width: '100%',
          height: '100%',
          backgroundColor: '#fff',
          alignContent: 'center',
          paddingHorizontal: 20,
          paddingTop:20,
        }}>
          <TouchableOpacity
         onPress={()=>{
          this.setState({Visaselalmras:false})
         }}>
            <Icon

              name="arrow-right" size={20} color="#000"

              style={{
                marginLeft:10,
                alignSelf:'flex-start',
              }} />
          </TouchableOpacity>
          <View
            style={{
              flexDirection: "row",
              // backgroundColor:'#000',
              alignItems:'center',
            
            }}>

            <View style={{
              backgroundColor:'#592c87',
              height:30,
              width:30,
              borderRadius:15,
              alignItems:'center',
              justifyContent:'center',

            }}>
               <Text
              style={{
                fontSize: 22,
                fontWeight: "800",
                color: "#fff"

              }}>؟</Text>


            </View>
            <Text
              style={{
                fontSize: 22,
                fontWeight: "800",
                marginVertical: 20,
                marginLeft: 10,
                color: "#000"

              }}>الأسئله الشائعه</Text>
          </View>
               
  

 <ScrollView showsVerticalScrollIndicator={false}> 
  <View>  
{this.state.arraseal2.map((item,index)=>
<>


<View style={{
  width:'100%',
  backgroundColor:this.state.arraseal2[index].itemcheck2?'#e6e1ec':'#592c87',
  alignSelf:'center',
  justifyContent:'center',
  paddingHorizontal:20,
  paddingVertical:20,
  justifyContent:'space-between',
  flexDirection:'row',
  borderRadius:20,
  marginVertical:10,
  
}}>
  <Text style={{
    fontSize:18,
    color:this.state.arraseal2[index].itemcheck2?'#592c87':'#fff',
    alignSelf:'center'
  }}>{item.itemName2}</Text>
  <TouchableOpacity style={{
    width:22,
    height:22,
    borderColor:this.state.arraseal2[index].itemcheck2?'#592c87':'#e6e1ec',
    borderWidth:2,
    alignSelf:'center',
    justifyContent:'center',
    borderRadius:7,

  }}
  onPress={()=>{
    this.checkedasela(index)
  }}>
    <Text style={{
    fontSize:20,
    color:'#592c87',
    alignSelf:'center',
    marginTop:-5,
   
  }}>-</Text> 
   
  </TouchableOpacity>

</View>
{item.itemcheck2?(
  <>
<View style={{
  
  width:'100%',
  backgroundColor:'#fff',
  alignSelf:'center',
  paddingHorizontal:10,
  paddingVertical:10,
  justifyContent:'space-between',


}}>
{this.state.arraseal2[index].item_d12.map((itemm,indexx)=>
  <Text style={{
    fontSize:17,
    color:'#a7a7a7',
    marginBottom:10,
  }}>{itemm.answer2}</Text>
 
  )}
  </View>

  </>
 ):null} 
  </>

)}

</View></ScrollView>
</View> 
</Modal> </View>
</Modal>


{/* {أنشطه} */}



<Modal
visible={this.state.Visactivitie}
onRequestClose={()=>{
this.setState({Visactivitie:false})
}}>


<StatusBar backgroundColor="#592c87" barStyle="light-content"  showsHorizontalScrollIndicator={false} />
        <View
          style={{
            flex: 1,
            backgroundColor: "#ffffff",
            paddingHorizontal: 20,
            paddingTop:20,
          }}>

          <View
            style={{
              width:"60%",
    height:80,
   // backgroundColor:"#0f0",
   alignItems:"flex-start",
    flexDirection:"column",

            }}>
            <TouchableOpacity>
              <Icon

                name="arrow-right" size={20} color="#000"

                style={{
                  marginLeft:10
                }} />
     </TouchableOpacity>
            <View
              style={{
                width:"95%",
                height:60,
                flexDirection:"row",
             //   backgroundColor:"#f0f",
               alignItems:"flex-end",
               justifyContent:"flex-start"
                
              }}>

              <Icon

                name="square" size={35} color="#592c87"

                style={{
            //      marginTop:15,
                //  alignSelf:"flex-start",
                  backgroundColor: "#592c87",
                  borderRadius: 7,
                //  alignSelf:"flex-start"
                }} />

              <Text
                style={{
                  fontSize:23,
                  fontWeight:"500",
                   //marginTop:10,
                  marginLeft:10,
                  color:"#000"
                 // alignSelf:"flex-start"

                }}>أنشطة الجمعية</Text>
            </View>
          </View>




            <View
              style={{
                flexDirection: "row",
                marginTop: 20,
              }}>
           <ScrollView horizontal={true}>

              {this.state.arr2.map((item, index) =>

                <>


                  <View
                    style={{
                      height: 210,
                    //  backgroundColor:'red'
                    }} >


                    <TouchableOpacity

                      onPress={() => {

                        this.setState({save_index2: index})

                      }}>

                      <Image source={item.img} style={{
                        width: 120,
                        height: 210,
                        // resizeMode: "stretch",
                        borderRadius: 30,
                        marginRight:20,
                      }} />
                    </TouchableOpacity>
                        </View>
                </>
              )}
</ScrollView>  
 </View>


          <View
            style={{
          marginTop:40
            }}>
              <Text
                      style={{
                      fontSize:25,
                      fontWeight:"700",
                      color: "#592c87",
                      }}>{this.state.arr2[this.state.save_index2].title}
                      </Text>
            <Text
              style={{
                fontSize:20,
                fontWeight:"500",
                color:"#000",
                opacity:.5,
                marginTop:10
              }} >
              {this.state.arr2[this.state.save_index2].desc}
            </Text>
          </View>


        </View>

</Modal>



        </View>

      </>

    );
  }
}